# SQL for Data Science

Prepared by [Yashar Mansouri](www.https://www.linkedin.com/in/yasharmansouri)

The used database and the order of the material is based on Dan Sullivan's [Advanced SQL for Data Science 2017](https://www.linkedin.com/learning/advanced-sql-for-data-scientists) and [Intermediate SQL for Data Scientists](https://www.linkedin.com/learning/intermediate-sql-for-data-scientists) LinkedIn Learning courses.

This is mostly the tuned up version with python implementation and revised queries.

If you entered a wrong query and received an error, mak sure to close connection and open up again:

- rememeber to change your arguements such as host, database name, password, port

- sql file with table creation and insertion is located in the **data** folder.

```python
cur.close()
conn.close()
conn = psycopg2.connect(host="localhost",database="data_sci", user="postgres", password="password", port=5432)
cur = conn.cursor()
```

In [112]:
# list of packages in the environment
!pip freeze

backcall==0.2.0
colorama==0.4.4
debugpy==1.4.1
decorator==5.0.9
entrypoints==0.3
greenlet==1.1.1
ipykernel==6.3.1
ipython==7.27.0
ipython-genutils==0.2.0
ipython-sql==0.4.0
jedi==0.18.0
joblib==1.0.1
jupyter-client==7.0.2
jupyter-core==4.7.1
matplotlib-inline==0.1.2
nest-asyncio==1.5.1
numpy==1.21.2
pandas==1.3.2
parso==0.8.2
pickleshare==0.7.5
prettytable==0.7.2
prompt-toolkit==3.0.20
psycopg2-binary==2.9.1
Pygments==2.10.0
python-dateutil==2.8.2
pytz==2021.1
pywin32==301
pyzmq==22.2.1
scikit-learn==0.24.2
scipy==1.7.1
six==1.16.0
SQLAlchemy==1.4.23
sqlparse==0.4.1
threadpoolctl==2.2.0
tornado==6.1
traitlets==5.1.0
wcwidth==0.2.5

## Connection = Using pandas and psycopg2

[PostgresSQL Tutorial](https://www.postgresqltutorial.com/postgresql-python/connect/)

### Import libraries

In [1]:
# !pip install psycopg2
# or
# !conda install psycopg2
# YOU DO YOU!
import psycopg2
import pandas as pd

### Create Connection & Cursor

In [2]:
#change user and password to your settings â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)
# port: the port number that defaults to 5432 if it is not provided.
conn = psycopg2.connect(host="localhost", database="data_sci", user="postgres", password="admin", port=5432)
cur = conn.cursor()

Code Template:
```python
cur = conn.cursor()
cmd = """SQL DDL/DML cmd"""
cur.execute(cmd)
cur.fetchone() or cur.fetchall()
cur.close()
conn.commit()
conn.close()
```

### Executing cmds

Version Check and Connection

In [3]:
cur.execute("""SELECT version()
            """)
cur.fetchone()

('PostgreSQL 13.4, compiled by Visual C++ build 1914, 64-bit',)

To check whether the cursor or the connection is connected:

In [4]:
conn is None and cur is None
#False

False

In [5]:
cur

In [6]:
conn

### Show Tables using PostgreSQL

This line comes from the PostgreSQL Tutorials:

If you are coming from MySQL, you may miss the SHOW TABLES statement that displays all tables in a specific database. PostgreSQL does not provide the SHOW TABLES statement directly but give you something similar Â¯\_(ãƒ„)_/Â¯.

In [7]:
cmd = """SELECT
         *
         FROM
         pg_catalog.pg_tables
         WHERE
         schemaname != 'pg_catalog'
         AND schemaname != 'information_schema';"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,data_sci,company_departments,postgres,None,True,False,False,False
1,data_sci,company_regions,postgres,None,True,False,False,False
2,data_sci,employees,postgres,None,True,False,False,False
3,data_sci,company_divisions,postgres,None,True,False,False,False
4,data_sci,staff,postgres,None,True,False,False,False

### Getting Column Names Trick:

In [8]:
print(cur.description)
print('ðŸ˜Ž'*30)
print(cur.description[0])
print('ðŸ™„'*30)
print(cur.description[0][0], cur.description[1][0], cur.description[2][0], cur.description[3][0], cur.description[4][0], cur.description[5][0], cur.description[6][0], cur.description[7][0])
print('ðŸ¤¯'*30)
print([col[0] for col in cur.description])

(Column(name='schemaname', type_code=19), Column(name='tablename', type_code=19), Column(name='tableowner', type_code=19), Column(name='tablespace', type_code=19), Column(name='hasindexes', type_code=16), Column(name='hasrules', type_code=16), Column(name='hastriggers', type_code=16), Column(name='rowsecurity', type_code=16))
ðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜ŽðŸ˜Ž
Column(name='schemaname', type_code=19)
ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„ðŸ™„
schemaname tablename tableowner tablespace hasindexes hasrules hastriggers rowsecurity
ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯ðŸ¤¯
['schemaname', 'tablename', 'tableowner', 'tablespace', 'hasindexes', 'hasrules', 'hastriggers', 'rowsecurity']

In [9]:
cur.description[0]

Column(name='schemaname', type_code=19)

### Checking the Tables

In [10]:
# setting search path to data_sci schema
cmd = """SET search_path TO data_sci"""
cur.execute(cmd)

In [11]:
cmd = """SELECT * FROM company_divisions;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

     department      company_division
0    Automotive       Auto & Hardware
1          Baby              Domestic
2        Beauty              Domestic
3      Clothing              Domestic
4     Computers  Electronic Equipment
5   Electronics  Electronic Equipment
6         Games              Domestic
7        Garden     Outdoors & Garden
8       Grocery              Domestic
9        Health              Domestic
10         Home              Domestic
11   Industrial       Auto & Hardware
12     Jewelery               Fashion
13         Kids              Domestic
14       Movies         Entertainment
15        Music         Entertainment
16     Outdoors     Outdoors & Garden
17        Shoes              Domestic
18       Sports        Games & Sports
19        Tools       Auto & Hardware
20         Toys        Games & Sports

In [12]:
cmd = """SELECT * FROM company_regions;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

   region_id       region_name country_name
0          1         northeast          usa
1          2         southeast          usa
2          3         northwest          usa
3          4         southwest          usa
4          5  british columbia       canada
5          6            quebec       canada
6          7       nova scotia       canada

In [13]:
cmd = """SELECT * FROM staff;"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

,id,last_name,email,gender,department,start_date,salary,job_title,region_id
0,1,Kelley,rkelley0@soundcloud.com,Female,Computers,2009-10-02,67470,Structural Engineer,2
1,2,Armstrong,sarmstrong1@infoseek.co.jp,Male,Sports,2008-03-31,71869,Financial Advisor,2
2,3,Carr,fcarr2@woothemes.com,Male,Automotive,2009-07-12,101768,Recruiting Manager,3
3,4,Murray,jmurray3@gov.uk,Female,Jewelery,2014-12-25,96897,Desktop Support Technician,3
4,5,Ellis,jellis4@sciencedirect.com,Female,Grocery,2002-09-19,63702,Software Engineer III,7
...,...,...,...,...,...,...,...,...,...
995,996,James,tjamesrn@soundcloud.com,Female,Games,2013-11-17,78433,Accountant II,7
996,997,Reynolds,dreynoldsro@blogtalkradio.com,Female,Computers,2007-04-16,120138,Statistician IV,1
997,998,Walker,kwalkerrp@unicef.org,Female,Games,2010-02-13,60363,Account Coordinator,1
998,999,Kennedy,lkennedyrq@edublogs.org,Male,Industrial,2004-09-22,48050,Graphic Designer,2
999,1000,Howard,showardrr@addtoany.com,Male,Baby,2003-11-07,148687,General Manager,3

In [107]:
cur.close()
conn.close()

## Connection = Using jupyter magic commands with ipython-sql

In [14]:
# pip install psycopg2-binary
# pip install ipython-sql
# pip install pandas

In [15]:
%load_ext sql

In [16]:
DB_ENDPOINT = 'localhost'
DB = 'data_sci'
DB_USER = 'postgres'
DB_PASSWORD = 'admin'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = f"postgresql://{DB_USER}:{DB_PASSWORD}@{DB_ENDPOINT}:{DB_PORT}/{DB}"

%sql allows us to run one liners and access python variables via $  
%%sql allows for multi liners but no access to python variables

In [17]:
%sql $conn_string

In [18]:
# set the search path to the data_sci schema (since we also have th epublic schema in the data_sci db)
# if we don't set this we have to call the table by schema_name.table_name
%sql SET search_path to data_sci;

 * postgresql://postgres:***@localhost:5432/data_sci
Done.

[]

## SQL COMMANDS

### LIMIT vs FETCH FIRST

Both will do the same thing, but `FETCH FIRST X ROWS ONLY` is the standard SQL. `LIMIT` is not a part of standard SQL.

In [80]:
%%sql
SELECT department, COUNT(*) staff_count
FROM staff 
GROUP BY department
ORDER BY staff_count
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/data_sci
5 rows affected.

[('Movies', 36), ('Music', 37), ('Kids', 38), ('Tools', 39), ('Sports', 40)]

In [81]:
%%sql
SELECT department, COUNT(*) staff_count
FROM staff
GROUP BY department
ORDER BY staff_count
FETCH FIRST 5 ROWS ONLY;

 * postgresql://postgres:***@localhost:5432/data_sci
5 rows affected.

[('Movies', 36), ('Music', 37), ('Kids', 38), ('Tools', 39), ('Sports', 40)]

### COUNT

In [19]:
%%sql
SELECT gender, COUNT(gender) FROM staff
         GROUP BY gender

 * postgresql://postgres:***@localhost:5432/data_sci
2 rows affected.

[('Female', 496), ('Male', 504)]

### MIN, MAX

In [20]:
%%sql
SELECT department, gender, MIN(salary), MAX(salary) 
        FROM staff
            GROUP BY department, gender
            ORDER BY department, gender 
            LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Automotive', 'Female', 42602, 136448),
 ('Automotive', 'Male', 44377, 146167),
 ('Baby', 'Female', 50448, 141464),
 ('Baby', 'Male', 42924, 148687),
 ('Beauty', 'Female', 41299, 143853),
 ('Beauty', 'Male', 40254, 149099),
 ('Books', 'Female', 47131, 145284),
 ('Books', 'Male', 42714, 146745),
 ('Clothing', 'Female', 42797, 148408),
 ('Clothing', 'Male', 43067, 130188)]

### Sum, Average, Variance, Standard Deviation

In [21]:
%%sql
SELECT 
    department, 
    SUM(salary) AS total_salary, 
    AVG(salary) AS average_salary,
    VAR_POP(salary) AS variance_salary,
    STDDEV_POP(salary) AS standard_deviation_salary 
    FROM staff
        GROUP BY department
        ORDER BY total_salary
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Music', 3274767, Decimal('88507.216216216216'), Decimal('1001696601.52081812'), Decimal('31649.59085866')),
 ('Kids', 3543027, Decimal('93237.552631578947'), Decimal('1072987422.93144044'), Decimal('32756.48673059')),
 ('Movies', 3632825, Decimal('100911.805555555556'), Decimal('876898879.10108025'), Decimal('29612.47843564')),
 ('Sports', 3756041, Decimal('93901.025000000000'), Decimal('1049150239.87437500'), Decimal('32390.58875467')),
 ('Toys', 3943674, Decimal('96187.170731707317'), Decimal('1150709491.31231410'), Decimal('33922.10918136')),
 ('Shoes', 3968118, Decimal('92281.813953488372'), Decimal('849306565.17468902'), Decimal('29142.86473864')),
 ('Jewelery', 4039362, Decimal('87812.217391304348'), Decimal('875256537.77882798'), Decimal('29584.73487762')),
 ('Tools', 4095808, Decimal('105020.717948717949'), Decimal('795868561.02301118'), Decimal('28211.14249766')),
 ('Baby', 4218724, Decimal('93749.422222222222'), Decimal('912220932.82172840'), Decimal('30202.99542797')),
 ('Industrial', 4366340, Decimal('92900.851063829787'), Decimal('889271955.27569036'), Decimal('29820.66322662'))]

### ROUND, TRUNC, CEIL
- ROUND() rounds the number to the n decimal point, or if n is not decalred then it rounds to the closest integer.  
- TRUNC() just gets rid of the decimals, if n is delared for TRUNC, then the remaining decimals gets dropped  
- CEIL() rounds the number up to the next integer

In [22]:
%%sql
-- # n = 2 in this case

SELECT 
    department, 
    SUM(salary) AS total_salary, 
    ROUND(AVG(salary),2) AS average_salary_round_2decimals,
    ROUND(AVG(salary)) AS average_salary_round,
    TRUNC(AVG(salary)) AS average_salary_truncated,
    CEIL(AVG(salary)) AS average_salary_ceiling
        FROM staff
        GROUP BY department
        ORDER BY total_salary;

 * postgresql://postgres:***@localhost:5432/data_sci
22 rows affected.

[('Music', 3274767, Decimal('88507.22'), Decimal('88507'), Decimal('88507'), Decimal('88508')),
 ('Kids', 3543027, Decimal('93237.55'), Decimal('93238'), Decimal('93237'), Decimal('93238')),
 ('Movies', 3632825, Decimal('100911.81'), Decimal('100912'), Decimal('100911'), Decimal('100912')),
 ('Sports', 3756041, Decimal('93901.03'), Decimal('93901'), Decimal('93901'), Decimal('93902')),
 ('Toys', 3943674, Decimal('96187.17'), Decimal('96187'), Decimal('96187'), Decimal('96188')),
 ('Shoes', 3968118, Decimal('92281.81'), Decimal('92282'), Decimal('92281'), Decimal('92282')),
 ('Jewelery', 4039362, Decimal('87812.22'), Decimal('87812'), Decimal('87812'), Decimal('87813')),
 ('Tools', 4095808, Decimal('105020.72'), Decimal('105021'), Decimal('105020'), Decimal('105021')),
 ('Baby', 4218724, Decimal('93749.42'), Decimal('93749'), Decimal('93749'), Decimal('93750')),
 ('Industrial', 4366340, Decimal('92900.85'), Decimal('92901'), Decimal('92900'), Decimal('92901')),
 ('Books', 4459837, Decimal('94890.15'), Decimal('94890'), Decimal('94890'), Decimal('94891')),
 ('Electronics', 4489141, Decimal('91615.12'), Decimal('91615'), Decimal('91615'), Decimal('91616')),
 ('Health', 4552880, Decimal('98975.65'), Decimal('98976'), Decimal('98975'), Decimal('98976')),
 ('Automotive', 4584268, Decimal('99658.00'), Decimal('99658'), Decimal('99658'), Decimal('99658')),
 ('Grocery', 4651241, Decimal('101113.93'), Decimal('101114'), Decimal('101113'), Decimal('101114')),
 ('Garden', 4792085, Decimal('101959.26'), Decimal('101959'), Decimal('101959'), Decimal('101960')),
 ('Home', 4822205, Decimal('92734.71'), Decimal('92735'), Decimal('92734'), Decimal('92735')),
 ('Clothing', 5037890, Decimal('95054.53'), Decimal('95055'), Decimal('95054'), Decimal('95055')),
 ('Games', 5090304, Decimal('103883.76'), Decimal('103884'), Decimal('103883'), Decimal('103884')),
 ('Computers', 5152963, Decimal('99095.44'), Decimal('99095'), Decimal('99095'), Decimal('99096')),
 ('Outdoors', 5378660, Decimal('112055.42'), Decimal('112055'), Decimal('112055'), Decimal('112056')),
 ('Beauty', 5481063, Decimal('103416.28'), Decimal('103416'), Decimal('103416'), Decimal('103417'))]

### CONCATENATION, LOWERCASE, UPPERCASE

In [23]:
%%sql
SELECT 
    UPPER(department) || ' â¨€â¨€â¨€ ' ||LOWER(job_title) fancy_column_name
        FROM staff
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('COMPUTERS â¨€â¨€â¨€ structural engineer',),
 ('SPORTS â¨€â¨€â¨€ financial advisor',),
 ('AUTOMOTIVE â¨€â¨€â¨€ recruiting manager',),
 ('JEWELERY â¨€â¨€â¨€ desktop support technician',),
 ('GROCERY â¨€â¨€â¨€ software engineer iii',),
 ('TOOLS â¨€â¨€â¨€ executive secretary',),
 ('COMPUTERS â¨€â¨€â¨€ dental hygienist',),
 ('TOYS â¨€â¨€â¨€ safety technician i',),
 ('JEWELERY â¨€â¨€â¨€ sales associate',),
 ('MOVIES â¨€â¨€â¨€ sales representative',)]

In [24]:
%%sql
SELECT 
    CONCAT(UPPER(department),
           ' (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)', 
           LOWER(job_title)
           ) do_you_even_code_bro
        FROM staff
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('COMPUTERS (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)structural engineer',),
 ('SPORTS (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)financial advisor',),
 ('AUTOMOTIVE (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)recruiting manager',),
 ('JEWELERY (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)desktop support technician',),
 ('GROCERY (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)software engineer iii',),
 ('TOOLS (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)executive secretary',),
 ('COMPUTERS (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)dental hygienist',),
 ('TOYS (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)safety technician i',),
 ('JEWELERY (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)sales associate',),
 ('MOVIES (â˜žï¾Ÿãƒ®ï¾Ÿ)â˜ž 2nd method â˜œ(ï¾Ÿãƒ®ï¾Ÿâ˜œ)sales representative',)]

In [25]:
%%sql
-- # concatenation with separator defined
SELECT CONCAT_WS(' - ', job_title, last_name, email)
    FROM employees
    LIMIT 5;

 * postgresql://postgres:***@localhost:5432/data_sci
5 rows affected.

[('structural engineer - kelley - rkelley0@soundcloud.com',),
 ('recruiting manager - carr - fcarr2@woothemes.com',),
 ('marketing assistant - alexander - kalexanderl@marketwatch.com',),
 ('electrical engineer - nguyen - mnguyen18@biblegateway.com',),
 ('senior editor - armstrong - parmstrong1d@hc360.com',)]

### INITCAP

Capitalizes the first letter

In [26]:
%%sql
SELECT department_name, 
       INITCAP(department_name)
    FROM company_departments
        LIMIT 5;

 * postgresql://postgres:***@localhost:5432/data_sci
5 rows affected.

[('automotive', 'Automotive'),
 ('baby', 'Baby'),
 ('beauty', 'Beauty'),
 ('clothing', 'Clothing'),
 ('computers', 'Computers')]

### TRIM, LENGTH, Derived Values (BOOLEAN Functions)

`LTRIM()` removes the left side spaces and `RTRIM()` removes the right side.

[Trim Tutorial](https://www.sqltutorial.org/sql-string-functions/sql-trim/)

In [27]:
%%sql
SELECT 
    TRIM(job_title) veeps, 
    department, 
    LENGTH(department),
    salary,
    (salary > 100000) six_digits_baby -- boolean value from a function
        FROM staff
        WHERE job_title ILIKE '%assist%'
        ORDER BY salary;

 * postgresql://postgres:***@localhost:5432/data_sci
88 rows affected.

[('Marketing Assistant', 'Baby', 4, 42924, False),
 ('Research Assistant I', 'Clothing', 8, 43067, False),
 ('Administrative Assistant IV', 'Outdoors', 8, 43366, False),
 ('Physical Therapy Assistant', 'Health', 6, 43431, False),
 ('Office Assistant II', 'Games', 5, 48064, False),
 ('Human Resources Assistant III', 'Sports', 6, 48812, False),
 ('Accounting Assistant I', 'Music', 5, 48892, False),
 ('Assistant Media Planner', 'Clothing', 8, 50235, False),
 ('Assistant Manager', 'Movies', 6, 51132, False),
 ('Assistant Media Planner', 'Garden', 6, 52430, False),
 ('Human Resources Assistant I', 'Electronics', 11, 52808, False),
 ('Accounting Assistant II', 'Computers', 9, 54231, False),
 ('Accounting Assistant IV', 'Kids', 4, 54470, False),
 ('Assistant Media Planner', 'Toys', 4, 54599, False),
 ('Research Assistant IV', 'Games', 5, 55002, False),
 ('Assistant Professor', 'Shoes', 5, 55073, False),
 ('Human Resources Assistant I', 'Clothing', 8, 55747, False),
 ('Marketing Assistant', 'Electronics', 11, 61332, False),
 ('Human Resources Assistant III', 'Movies', 6, 61519, False),
 ('Research Assistant IV', 'Home', 4, 63929, False),
 ('Marketing Assistant', 'Computers', 9, 65083, False),
 ('Assistant Media Planner', 'Baby', 4, 66847, False),
 ('Accounting Assistant IV', 'Beauty', 6, 69045, False),
 ('Marketing Assistant', 'Clothing', 8, 72854, False),
 ('Administrative Assistant II', 'Outdoors', 8, 76063, False),
 ('Human Resources Assistant IV', 'Toys', 4, 76352, False),
 ('Accounting Assistant II', 'Kids', 4, 76731, False),
 ('Legal Assistant', 'Industrial', 10, 76932, False),
 ('Assistant Media Planner', 'Grocery', 7, 80417, False),
 ('Administrative Assistant III', 'Automotive', 10, 82244, False),
 ('Assistant Media Planner', 'Garden', 6, 83706, False),
 ('Research Assistant II', 'Health', 6, 83802, False),
 ('Marketing Assistant', 'Automotive', 10, 84356, False),
 ('Administrative Assistant III', 'Shoes', 5, 86803, False),
 ('Assistant Manager', 'Movies', 6, 87057, False),
 ('Assistant Manager', 'Automotive', 10, 87134, False),
 ('Administrative Assistant I', 'Books', 5, 87816, False),
 ('Assistant Professor', 'Music', 5, 90069, False),
 ('Research Assistant II', 'Books', 5, 90409, False),
 ('Research Assistant I', 'Movies', 6, 91660, False),
 ('Assistant Manager', 'Music', 5, 92043, False),
 ('Accounting Assistant I', 'Beauty', 6, 96673, False),
 ('Assistant Manager', 'Electronics', 11, 98339, False),
 ('Accounting Assistant I', 'Health', 6, 103182, True),
 ('Accounting Assistant I', 'Tools', 5, 103806, True),
 ('Assistant Manager', 'Tools', 5, 104326, True),
 ('Research Assistant III', 'Clothing', 8, 104517, True),
 ('Human Resources Assistant II', 'Computers', 9, 105444, True),
 ('Office Assistant III', 'Clothing', 8, 107535, True),
 ('Legal Assistant', 'Beauty', 6, 110749, True),
 ('Research Assistant II', 'Automotive', 10, 111041, True),
 ('Marketing Assistant', 'Games', 5, 114989, True),
 ('Marketing Assistant', 'Clothing', 8, 116266, True),
 ('Legal Assistant', 'Clothing', 8, 116333, True),
 ('Accounting Assistant III', 'Outdoors', 8, 118514, True),
 ('Research Assistant III', 'Toys', 4, 118793, True),
 ('Administrative Assistant I', 'Clothing', 8, 119097, True),
 ('Assistant Media Planner', 'Tools', 5, 119385, True),
 ('Research Assistant II', 'Outdoors', 8, 119414, True),
 ('Human Resources Assistant III', 'Home', 4, 120085, True),
 ('Assistant Media Planner', 'Movies', 6, 120579, True),
 ('Human Resources Assistant II', 'Automotive', 10, 121300, True),
 ('Assistant Media Planner', 'Beauty', 6, 123995, True),
 ('Assistant Professor', 'Baby', 4, 125398, True),
 ('Office Assistant II', 'Health', 6, 125944, True),
 ('Accounting Assistant III', 'Baby', 4, 127291, True),
 ('Legal Assistant', 'Movies', 6, 127645, True),
 ('Office Assistant III', 'Automotive', 10, 128885, True),
 ('Office Assistant IV', 'Beauty', 6, 130097, True),
 ('Legal Assistant', 'Outdoors', 8, 131961, True),
 ('Office Assistant I', 'Books', 5, 133781, True),
 ('Accounting Assistant IV', 'Garden', 6, 134114, True),
 ('Research Assistant III', 'Health', 6, 135132, True),
 ('Assistant Media Planner', 'Games', 5, 135886, True),
 ('Office Assistant IV', 'Beauty', 6, 136356, True),
 ('Assistant Professor', 'Industrial', 10, 136917, True),
 ('Human Resources Assistant I', 'Grocery', 7, 138093, True),
 ('Physical Therapy Assistant', 'Books', 5, 138815, True),
 ('Assistant Professor', 'Home', 4, 139060, True),
 ('Legal Assistant', 'Kids', 4, 139163, True),
 ('Office Assistant IV', 'Garden', 6, 139796, True),
 ('Assistant Professor', 'Outdoors', 8, 141753, True),
 ('Marketing Assistant', 'Automotive', 10, 144724, True),
 ('Marketing Assistant', 'Outdoors', 8, 144932, True),
 ('Office Assistant III', 'Toys', 4, 145559, True),
 ('Assistant Professor', 'Automotive', 10, 146167, True),
 ('Research Assistant II', 'Books', 5, 146701, True),
 ('Assistant Media Planner', 'Books', 5, 146745, True)]

### SUBSTRING, OVERLAY
Both `SUBSTRING()` and `OVERLAY()` have the syntax of `FROM n FOR m` or `value, n, m`. If `FOR` is not defined it will go to the end of the string.

In [28]:
%%sql
SELECT
    OVERLAY(job_title PLACING 'Vice President ' FROM 1 FOR 3) replaced_vp,
    SUBSTRING(job_title FROM 4) vp_position
    FROM staff
        WHERE job_title ILIKE '%VP%'
        ORDER BY salary
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Vice President Marketing', 'Marketing'),
 ('Vice President Product Management', 'Product Management'),
 ('Vice President Marketing', 'Marketing'),
 ('Vice President Accounting', 'Accounting'),
 ('Vice President Sales', 'Sales'),
 ('Vice President Quality Control', 'Quality Control'),
 ('Vice President Product Management', 'Product Management'),
 ('Vice President Product Management', 'Product Management'),
 ('Vice President Accounting', 'Accounting'),
 ('Vice President Accounting', 'Accounting')]

### LIKE, SIMILAR TO
Cool Regex Websites:  
[Regex101](https://regex101.com/)  
[Regexer](https://regexr.com/)

In [29]:
%%sql
-- # not the cool way, repetition causes depletion of life energy and then you get fired! (â•¯Â°â–¡Â°ï¼‰â•¯ï¸µ â”»â”â”»)
SELECT job_title 
    FROM staff
        WHERE job_title LIKE '%IV%' 
        OR job_title LIKE '%III%' 
        OR job_title LIKE '%II%' 
        OR job_title LIKE '%I%'
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Software Engineer III',),
 ('Safety Technician I',),
 ('Software Test Engineer III',),
 ('Web Developer III',),
 ('Programmer IV',),
 ('Geologist II',),
 ('Account Representative III',),
 ('Accountant I',),
 ('Web Developer III',),
 ('Account Representative III',)]

In [30]:
%%sql
-- # all titles having levels at the end with any character before them
-- #this way has few more computational units as well, yet both of them are 1 loop scans
SELECT job_title FROM staff
         WHERE job_title SIMILAR TO '%(I|II|III|IV)%'
         ORDER BY job_title
         LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Account Representative I',),
 ('Account Representative I',),
 ('Account Representative I',),
 ('Account Representative I',),
 ('Account Representative II',),
 ('Account Representative III',),
 ('Account Representative III',),
 ('Account Representative III',),
 ('Account Representative III',),
 ('Account Representative IV',)]

In [31]:
%%sql
-- # only jobs that start with Developer and any words in between and then levels and any words afterwards
SELECT job_title 
    FROM staff
      WHERE job_title SIMILAR TO 'Developer%(I|II|III|IV)%'
      LIMIt 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Developer III',),
 ('Developer IV',),
 ('Developer IV',),
 ('Developer IV',),
 ('Developer IV',),
 ('Developer II',),
 ('Developer III',),
 ('Developer IV',),
 ('Developer I',),
 ('Developer III',)]

In [32]:
%%sql
-- #any word that starts with letters L or O or V or E à²¥_à²¥
SELECT job_title 
    FROM staff
        WHERE job_title 
        SIMILAR TO '[LOVE]%'
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Executive Secretary',),
 ('VP Sales',),
 ('VP Quality Control',),
 ('Executive Secretary',),
 ('Librarian',),
 ('Executive Secretary',),
 ('Electrical Engineer',),
 ('Editor',),
 ('VP Marketing',),
 ('Environmental Tech',)]

In [33]:
%%sql
-- # any word that starts from the range of A to F
SELECT DISTINCT job_title
    FROM staff
        WHERE job_title 
        SIMILAR TO '[A-F]%'
        ORDER BY job_title
        LIMIT 20;

 * postgresql://postgres:***@localhost:5432/data_sci
20 rows affected.

[('Account Coordinator',),
 ('Account Executive',),
 ('Account Representative I',),
 ('Account Representative II',),
 ('Account Representative III',),
 ('Account Representative IV',),
 ('Accountant I',),
 ('Accountant II',),
 ('Accountant III',),
 ('Accountant IV',),
 ('Accounting Assistant I',),
 ('Accounting Assistant II',),
 ('Accounting Assistant III',),
 ('Accounting Assistant IV',),
 ('Actuary',),
 ('Administrative Assistant I',),
 ('Administrative Assistant II',),
 ('Administrative Assistant III',),
 ('Administrative Assistant IV',),
 ('Administrative Officer',)]

### SOUNDEX, DIFFERENCE, LEVENSHTEIN

Helps with identifying values that algorithmically sound the same. Useful for finding misspelled words.

In [34]:
# The extension needs to be installed.
%sql CREATE EXTENSION IF NOT EXISTS fuzzystrmatch;

 * postgresql://postgres:***@localhost:5432/data_sci
Done.

[]

In [35]:
%%sql
-- # assigns a value to strings
SELECT
    SOUNDEX('Yashar') yashar,
    SOUNDEX('Yashaar') yashaar,
    SOUNDEX('Yasharrrr') yasharrrr,
    SOUNDEX('Yasha') yasha,
    SOUNDEX('Asha') asha;

 * postgresql://postgres:***@localhost:5432/data_sci
1 rows affected.

[('Y260', 'Y260', 'Y260', 'Y200', 'A200')]

In [36]:
%%sql
-- # shows the difference between value and ranges from 0 to 4 with 4 being the exact match.
SELECT DIFFERENCE('Yashar', 'Yashir');

 * postgresql://postgres:***@localhost:5432/data_sci
1 rows affected.

[(4,)]

In [37]:
%%sql
-- # Returns distance between two strings
-- # so 3 for the following means 3 extra r
SELECT LEVENSHTEIN('Yashar', 'Yasharrrr');

 * postgresql://postgres:***@localhost:5432/data_sci
1 rows affected.

[(3,)]

### CASE WHEN

In [38]:
cmd = """SELECT job_title, 
         CASE WHEN job_title SIMILAR TO '%IV' THEN 'IV'
	     WHEN job_title SIMILAR TO '%III' THEN 'III'
	     WHEN job_title SIMILAR TO '%II' THEN 'II'
	     WHEN job_title SIMILAR TO '%I' THEN 'I'
         END AS levels
         FROM staff
         WHERE job_title SIMILAR TO '(%I|II|III|IV)'
         ORDER BY job_title"""
cur.execute(cmd)
cols = [x[0] for x in cur.description]
pd.DataFrame(cur.fetchall(), columns=cols)

                     job_title levels
0     Account Representative I      I
1     Account Representative I      I
2     Account Representative I      I
3     Account Representative I      I
4    Account Representative II     II
..                         ...    ...
193          Web Developer III    III
194          Web Developer III    III
195          Web Developer III    III
196          Web Developer III    III
197          Web Developer III    III

[198 rows x 2 columns]

## Subqueries

### SELECT Clause Subquery (New Column)

In [39]:
%%sql
-- #getting the per department average for each employee( â€¢_â€¢)>âŒâ– -â– 
SELECT 
    s1.last_name,
    s1.job_title, 
    s1.salary, 
    s1.department, 
    (SELECT ROUND(AVG(SALARY)) FROM staff s2 WHERE s2.department = s1.department)
        FROM staff s1
        ORDER BY s1.department, s1.salary
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Meyer', 'Programmer IV', 42602, 'Automotive', Decimal('99658')),
 ('Burns', 'Technical Writer', 44377, 'Automotive', Decimal('99658')),
 ('Duncan', 'Electrical Engineer', 45774, 'Automotive', Decimal('99658')),
 ('Marshall', 'VP Sales', 47281, 'Automotive', Decimal('99658')),
 ('Peterson', 'Pharmacist', 53964, 'Automotive', Decimal('99658')),
 ('Simmons', 'Biostatistician I', 58555, 'Automotive', Decimal('99658')),
 ('Foster', 'Community Outreach Specialist', 63364, 'Automotive', Decimal('99658')),
 ('Rose', 'Software Test Engineer I', 66063, 'Automotive', Decimal('99658')),
 ('Gutierrez', 'Desktop Support Technician', 67800, 'Automotive', Decimal('99658')),
 ('Mcdonald', 'Recruiting Manager', 69594, 'Automotive', Decimal('99658'))]

## FROM Clause Subquery

Both of the following queries will produce the same result, yet one of them can be more context specific/readable.

In [40]:
%%sql
SELECT department, ROUND(STDDEV(SALARY), 2)
       FROM staff
       WHERE salary < 50000
       GROUP BY department;

 * postgresql://postgres:***@localhost:5432/data_sci
21 rows affected.

[('Tools', Decimal('1755.75')),
 ('Electronics', Decimal('3029.66')),
 ('Sports', Decimal('5935.45')),
 ('Books', Decimal('2229.88')),
 ('Clothing', Decimal('732.50')),
 ('Kids', Decimal('3043.24')),
 ('Music', Decimal('3127.45')),
 ('Automotive', Decimal('1995.02')),
 ('Outdoors', Decimal('1913.43')),
 ('Toys', Decimal('2686.47')),
 ('Industrial', Decimal('4260.74')),
 ('Health', Decimal('2437.21')),
 ('Grocery', Decimal('342.06')),
 ('Movies', Decimal('4281.94')),
 ('Jewelery', Decimal('3258.09')),
 ('Home', Decimal('3003.46')),
 ('Baby', Decimal('3460.07')),
 ('Shoes', Decimal('2380.12')),
 ('Games', Decimal('3564.90')),
 ('Beauty', Decimal('4360.02')),
 ('Computers', Decimal('1124.72'))]

In [41]:
%%sql
-- # standard deviation of salaries lower than 50k per department
SELECT s1.department, 
       ROUND(STDDEV(s1.salary),2) standard_deviation_salary_lower_50k
           FROM (SELECT department, salary FROM staff WHERE salary < 50000) s1
           GROUP BY s1.department;

 * postgresql://postgres:***@localhost:5432/data_sci
21 rows affected.

[('Tools', Decimal('1755.75')),
 ('Electronics', Decimal('3029.66')),
 ('Sports', Decimal('5935.45')),
 ('Books', Decimal('2229.88')),
 ('Clothing', Decimal('732.50')),
 ('Kids', Decimal('3043.24')),
 ('Music', Decimal('3127.45')),
 ('Automotive', Decimal('1995.02')),
 ('Outdoors', Decimal('1913.43')),
 ('Toys', Decimal('2686.47')),
 ('Industrial', Decimal('4260.74')),
 ('Health', Decimal('2437.21')),
 ('Grocery', Decimal('342.06')),
 ('Movies', Decimal('4281.94')),
 ('Jewelery', Decimal('3258.09')),
 ('Home', Decimal('3003.46')),
 ('Baby', Decimal('3460.07')),
 ('Shoes', Decimal('2380.12')),
 ('Games', Decimal('3564.90')),
 ('Beauty', Decimal('4360.02')),
 ('Computers', Decimal('1124.72'))]

### WHERE Clause Subquery

In [42]:
%%sql
-- # selecting employees where their salary is between the average salary of the Toys department and 110k

SELECT last_name, job_title, department, salary
      FROM staff
      WHERE salary 
      BETWEEN
      (SELECT AVG(salary) FROM staff
      WHERE department='Toys'
      GROUP BY department) 
      AND 110000
      ORDER BY salary
      LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Price', 'Graphic Designer', 'Baby', 96388),
 ('Mason', 'Accounting Assistant I', 'Beauty', 96673),
 ('Cole', 'Product Engineer', 'Sports', 96739),
 ('Ruiz', 'Database Administrator II', 'Outdoors', 96782),
 ('Murray', 'Desktop Support Technician', 'Jewelery', 96897),
 ('Robertson', 'Software Test Engineer I', 'Garden', 96996),
 ('Clark', 'VP Accounting', 'Movies', 97150),
 ('Cook', 'Health Coach I', 'Garden', 97351),
 ('Hanson', 'Systems Administrator I', 'Electronics', 97372),
 ('Reed', 'Occupational Therapist', 'Baby', 97427)]

In [88]:
%%sql
-- # returns the count of employees in departments where the total salary paid in that department is greater than 5,000,00.Cha Ching!$$$

SELECT department, COUNT(*) AS num_employees
    FROM staff
    WHERE department IN (
        SELECT department
        FROM staff
        GROUP BY department
        HAVING SUM(salary) > 5000000)
    GROUP BY department
    ;

 * postgresql://postgres:***@localhost:5432/data_sci
5 rows affected.

[('Clothing', 53),
 ('Outdoors', 48),
 ('Games', 49),
 ('Beauty', 53),
 ('Computers', 52)]

## Joins

In [100]:
# %sql SELECT * FROM staff LIMIT 10;
# %sql SELECT * FROM company_divisions LIMIT 10;
# %sql SELECT * FROM company_regions LIMIT 10;
%sql ALTER TABLE company_regions RENAME COLUMN id TO region_id;

 * postgresql://postgres:***@localhost:5432/data_sci

In [43]:
%%sql
-- # we can use USING(shared_column_name) when the column names are the same
SELECT *
      FROM staff
      LEFT JOIN company_divisions
      USING (department)
      LEFT JOIN company_regions
      USING (region_id)
      LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[(2, 'Computers', 1, 'Kelley', 'rkelley0@soundcloud.com', 'Female', datetime.date(2009, 10, 2), 67470, 'Structural Engineer', 'Electronic Equipment', 'southeast', 'usa'),
 (2, 'Sports', 2, 'Armstrong', 'sarmstrong1@infoseek.co.jp', 'Male', datetime.date(2008, 3, 31), 71869, 'Financial Advisor', 'Games & Sports', 'southeast', 'usa'),
 (3, 'Automotive', 3, 'Carr', 'fcarr2@woothemes.com', 'Male', datetime.date(2009, 7, 12), 101768, 'Recruiting Manager', 'Auto & Hardware', 'northwest', 'usa'),
 (3, 'Jewelery', 4, 'Murray', 'jmurray3@gov.uk', 'Female', datetime.date(2014, 12, 25), 96897, 'Desktop Support Technician', 'Fashion', 'northwest', 'usa'),
 (7, 'Grocery', 5, 'Ellis', 'jellis4@sciencedirect.com', 'Female', datetime.date(2002, 9, 19), 63702, 'Software Engineer III', 'Domestic', 'nova scotia', 'canada'),
 (1, 'Tools', 6, 'Phillips', 'bphillips5@time.com', 'Male', datetime.date(2013, 8, 21), 118497, 'Executive Secretary', 'Auto & Hardware', 'northeast', 'usa'),
 (6, 'Computers', 7, 'Williamson', 'rwilliamson6@ted.com', 'Male', datetime.date(2006, 5, 14), 65889, 'Dental Hygienist', 'Electronic Equipment', 'quebec', 'canada'),
 (4, 'Toys', 8, 'Harris', 'aharris7@ucoz.com', 'Female', datetime.date(2003, 8, 12), 84427, 'Safety Technician I', 'Games & Sports', 'southwest', 'usa'),
 (2, 'Jewelery', 9, 'James', 'rjames8@prnewswire.com', 'Male', datetime.date(2005, 9, 7), 108657, 'Sales Associate', 'Fashion', 'southeast', 'usa'),
 (1, 'Movies', 10, 'Sanchez', 'rsanchez9@cloudflare.com', 'Male', datetime.date(2013, 3, 13), 108093, 'Sales Representative', 'Entertainment', 'northeast', 'usa')]

### Filtering & Joining

In [45]:
%%sql
SELECT *
        FROM staff
        INNER JOIN company_regions
        USING (region_id)
        INNER JOIN company_divisions
        USING (department)
        WHERE company_division IN ('Electronic Equipment', 'Games & Sports')
        AND
        department = 'Electronics'
        AND
        last_name ILIKE 's%'
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
4 rows affected.

[('Electronics', 2, 679, 'Stone', 'pstoneiu@narod.ru', 'Male', datetime.date(2014, 5, 15), 40218, 'Paralegal', 'southeast', 'usa', 'Electronic Equipment'),
 ('Electronics', 7, 762, 'Stanley', 'cstanleyl5@springer.com', 'Male', datetime.date(2013, 8, 9), 103237, 'Account Executive', 'nova scotia', 'canada', 'Electronic Equipment'),
 ('Electronics', 1, 906, 'Spencer', 'sspencerp5@mtv.com', 'Male', datetime.date(2014, 4, 18), 110881, 'Electrical Engineer', 'northeast', 'usa', 'Electronic Equipment'),
 ('Electronics', 1, 985, 'Stevens', 'hstevensrc@hugedomains.com', 'Male', datetime.date(2006, 2, 28), 118791, 'Safety Technician IV', 'northeast', 'usa', 'Electronic Equipment')]

In [46]:
%%sql
-- # if the joining column names are not the same then:

SELECT *
       FROM staff s
       INNER JOIN company_regions cr
       ON cr.region_id=s.region_id
       INNER JOIN company_divisions cd
       ON s.department=cd.department
       WHERE company_division IN ('Electronic Equipment', 'Games & Sports')
	   AND
	   s.department = 'Electronics'
	   AND
	   last_name ILIKE 's%'
       LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
4 rows affected.

[(679, 'Stone', 'pstoneiu@narod.ru', 'Male', 'Electronics', datetime.date(2014, 5, 15), 40218, 'Paralegal', 2, 2, 'southeast', 'usa', 'Electronics', 'Electronic Equipment'),
 (762, 'Stanley', 'cstanleyl5@springer.com', 'Male', 'Electronics', datetime.date(2013, 8, 9), 103237, 'Account Executive', 7, 7, 'nova scotia', 'canada', 'Electronics', 'Electronic Equipment'),
 (906, 'Spencer', 'sspencerp5@mtv.com', 'Male', 'Electronics', datetime.date(2014, 4, 18), 110881, 'Electrical Engineer', 1, 1, 'northeast', 'usa', 'Electronics', 'Electronic Equipment'),
 (985, 'Stevens', 'hstevensrc@hugedomains.com', 'Male', 'Electronics', datetime.date(2006, 2, 28), 118791, 'Safety Technician IV', 1, 1, 'northeast', 'usa', 'Electronics', 'Electronic Equipment')]

## Views

Views can help us preserve the tables we created and additionally save us processing power and cause less strain on the server.

In [48]:
%%sql
/*
#instead of typing the same command for the upper table we can create view:
#CREATE OR REPLACE makes sure the table gets overwritten if it already exists use it wisely
#if table already exists and you try to create with same name, you get error.
*/
CREATE OR REPLACE VIEW staff_div_reg AS
         SELECT *
         FROM staff
         LEFT JOIN company_divisions
         USING (department)
         LEFT JOIN company_regions
         USING (region_id)
         ORDER BY country_name, company_regions;

 * postgresql://postgres:***@localhost:5432/data_sci
Done.

[]

In [49]:
%%sql
SELECT * 
    FROM staff_div_reg
    LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[(5, 'Music', 80, 'Little', 'klittle27@un.org', 'Male', datetime.date(2001, 9, 12), 114647, 'Editor', 'Entertainment', 'british columbia', 'canada'),
 (5, 'Movies', 95, 'Franklin', 'sfranklin2m@wordpress.com', 'Male', datetime.date(2013, 11, 6), 117105, 'VP Quality Control', 'Entertainment', 'british columbia', 'canada'),
 (5, 'Toys', 54, 'Reed', 'sreed1h@intel.com', 'Female', datetime.date(2001, 4, 15), 84275, 'VP Marketing', 'Games & Sports', 'british columbia', 'canada'),
 (5, 'Outdoors', 60, 'Lane', 'elane1n@un.org', 'Male', datetime.date(2004, 7, 15), 104896, 'Financial Advisor', 'Outdoors & Garden', 'british columbia', 'canada'),
 (5, 'Outdoors', 81, 'Welch', 'jwelch28@1und1.de', 'Male', datetime.date(2004, 7, 24), 118514, 'Accounting Assistant III', 'Outdoors & Garden', 'british columbia', 'canada'),
 (5, 'Electronics', 93, 'Knight', 'nknight2k@cafepress.com', 'Female', datetime.date(2014, 4, 3), 125847, 'Chemical Engineer', 'Electronic Equipment', 'british columbia', 'canada'),
 (5, 'Movies', 20, 'Carr', 'dcarrj@ocn.ne.jp', 'Female', datetime.date(2007, 11, 22), 115274, 'VP Quality Control', 'Entertainment', 'british columbia', 'canada'),
 (5, 'Clothing', 47, 'Oliver', 'joliver1a@cnbc.com', 'Female', datetime.date(2013, 8, 30), 42797, 'Software Engineer III', 'Domestic', 'british columbia', 'canada'),
 (5, 'Home', 18, 'Nguyen', 'jnguyenh@google.com', 'Male', datetime.date(2014, 11, 3), 93804, 'Geologist II', 'Domestic', 'british columbia', 'canada'),
 (5, 'Kids', 106, 'Gardner', 'rgardner2x@theguardian.com', 'Male', datetime.date(2009, 8, 6), 47879, 'Product Engineer', 'Domestic', 'british columbia', 'canada')]

## Grouping & Totaling

In [53]:
%%sql
-- # count of employee genders per region
SELECT country_name, 
       region_name, 
       COUNT(*), gender, 
       ROUND(AVG(salary),2) avg_salary
           FROM staff_div_reg
           GROUP BY country_name, region_name, gender
           ORDER BY country_name, region_name
           LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('canada', 'british columbia', 57, 'Female', Decimal('95677.95')),
 ('canada', 'british columbia', 72, 'Male', Decimal('95605.78')),
 ('canada', 'nova scotia', 83, 'Female', Decimal('101421.61')),
 ('canada', 'nova scotia', 76, 'Male', Decimal('97003.25')),
 ('canada', 'quebec', 51, 'Female', Decimal('95084.75')),
 ('canada', 'quebec', 66, 'Male', Decimal('98259.64')),
 ('usa', 'northeast', 77, 'Female', Decimal('99341.40')),
 ('usa', 'northeast', 67, 'Male', Decimal('95078.01')),
 ('usa', 'northwest', 67, 'Female', Decimal('97732.54')),
 ('usa', 'northwest', 62, 'Male', Decimal('96546.98'))]

### GROUPING SETS

This will allows us to get breakdown per any group we want. This is similar to running multiple select statements per each group and then UNIONing them.

[brytlyt](https://www.brytlyt.com/documentation/data-manipulation-dml/grouping-sets-rollup-cube/)
[Database Journal](https://www.databasejournal.com/features/mssql/using-the-rollup-cube-and-grouping-sets-operators.html)

In [126]:
%%sql
-- # Gender Equality Breakdown: (âŒâ– _â– )
-- #the last two rows with nulls are because the books department didn't have any division named, hence the nulls. nvmÂ¯\_(ãƒ„)_/Â¯.
SELECT
      country_name, 
      company_division, 
      region_name, 
      gender, 
      COUNT(*), 
      ROUND(AVG(salary),2) avg_salary
          FROM staff_div_reg
          GROUP BY gender, GROUPING SETS (country_name, company_division, region_name, gender)
          ORDER BY country_name, region_name, company_division, gender;

 * postgresql://postgres:***@localhost:5432/data_sci
36 rows affected.

[('canada', None, None, 'Female', 191, Decimal('98015.49')),
 ('canada', None, None, 'Male', 214, Decimal('96920.56')),
 ('usa', None, None, 'Female', 305, Decimal('97410.63')),
 ('usa', None, None, 'Male', 290, Decimal('97100.08')),
 (None, None, 'british columbia', 'Female', 57, Decimal('95677.95')),
 (None, None, 'british columbia', 'Male', 72, Decimal('95605.78')),
 (None, None, 'northeast', 'Female', 77, Decimal('99341.40')),
 (None, None, 'northeast', 'Male', 67, Decimal('95078.01')),
 (None, None, 'northwest', 'Female', 67, Decimal('97732.54')),
 (None, None, 'northwest', 'Male', 62, Decimal('96546.98')),
 (None, None, 'nova scotia', 'Female', 83, Decimal('101421.61')),
 (None, None, 'nova scotia', 'Male', 76, Decimal('97003.25')),
 (None, None, 'quebec', 'Female', 51, Decimal('95084.75')),
 (None, None, 'quebec', 'Male', 66, Decimal('98259.64')),
 (None, None, 'southeast', 'Female', 72, Decimal('93156.57')),
 (None, None, 'southeast', 'Male', 82, Decimal('94350.26')),
 (None, None, 'southwest', 'Female', 89, Decimal('98939.35')),
 (None, None, 'southwest', 'Male', 79, Decimal('102103.30')),
 (None, 'Auto & Hardware', None, 'Female', 59, Decimal('99611.46')),
 (None, 'Auto & Hardware', None, 'Male', 73, Decimal('98210.14')),
 (None, 'Domestic', None, 'Female', 221, Decimal('98206.00')),
 (None, 'Domestic', None, 'Male', 204, Decimal('96381.99')),
 (None, 'Electronic Equipment', None, 'Female', 49, Decimal('94066.06')),
 (None, 'Electronic Equipment', None, 'Male', 52, Decimal('96785.90')),
 (None, 'Entertainment', None, 'Female', 33, Decimal('93534.15')),
 (None, 'Entertainment', None, 'Male', 40, Decimal('95524.13')),
 (None, 'Fashion', None, 'Female', 20, Decimal('86788.50')),
 (None, 'Fashion', None, 'Male', 26, Decimal('88599.69')),
 (None, 'Games & Sports', None, 'Female', 39, Decimal('93591.62')),
 (None, 'Games & Sports', None, 'Male', 42, Decimal('96420.05')),
 (None, 'Outdoors & Garden', None, 'Female', 51, Decimal('106586.27')),
 (None, 'Outdoors & Garden', None, 'Male', 44, Decimal('107610.11')),
 (None, None, None, 'Female', 24, Decimal('97208.04')),
 (None, None, None, 'Female', 496, Decimal('97643.55')),
 (None, None, None, 'Male', 504, Decimal('97023.85')),
 (None, None, None, 'Male', 23, Decimal('92471.48'))]

## ROLLUP: Aggregates in Hierarchy

In [59]:
%%sql
-- # compare this normal group by to the ones below
SELECT country_name,region_name, count(*)
         FROM staff_div_reg
         GROUP BY country_name, region_name
         ORDER BY country_name, region_name;

 * postgresql://postgres:***@localhost:5432/data_sci
7 rows affected.

[('canada', 'british columbia', 129),
 ('canada', 'nova scotia', 159),
 ('canada', 'quebec', 117),
 ('usa', 'northeast', 144),
 ('usa', 'northwest', 129),
 ('usa', 'southeast', 154),
 ('usa', 'southwest', 168)]

In [60]:
%%sql
-- # So in the following table we have the total of all canada regions, all USA regions, and also USA + Canada: So Hierarchical!

SELECT country_name, 
       region_name, 
       count(*)
          FROM staff_div_reg
          GROUP BY ROLLUP(country_name, region_name)
          ORDER BY country_name, region_name;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('canada', 'british columbia', 129),
 ('canada', 'nova scotia', 159),
 ('canada', 'quebec', 117),
 ('canada', None, 405),
 ('usa', 'northeast', 144),
 ('usa', 'northwest', 129),
 ('usa', 'southeast', 154),
 ('usa', 'southwest', 168),
 ('usa', None, 595),
 (None, None, 1000)]

### CUBE
It builds all groupings, combinations, and totals.

In [62]:
%%sql
SELECT country_name, region_name, ROUND(AVG(salary),2)
         FROM staff_div_reg
         GROUP BY CUBE(country_name, region_name);

 * postgresql://postgres:***@localhost:5432/data_sci
17 rows affected.

[(None, None, Decimal('97331.22')),
 ('canada', 'quebec', Decimal('96875.71')),
 ('canada', 'british columbia', Decimal('95637.67')),
 ('usa', 'northeast', Decimal('97357.74')),
 ('usa', 'southwest', Decimal('100427.16')),
 ('canada', 'nova scotia', Decimal('99309.69')),
 ('usa', 'northwest', Decimal('97162.74')),
 ('usa', 'southeast', Decimal('93792.17')),
 ('usa', None, Decimal('97259.27')),
 ('canada', None, Decimal('97436.93')),
 (None, 'northwest', Decimal('97162.74')),
 (None, 'british columbia', Decimal('95637.67')),
 (None, 'southeast', Decimal('93792.17')),
 (None, 'northeast', Decimal('97357.74')),
 (None, 'southwest', Decimal('100427.16')),
 (None, 'quebec', Decimal('96875.71')),
 (None, 'nova scotia', Decimal('99309.69'))]

## Window Functions

Window functions allow us to make SQL statements about rows related to the current row during processing.

### OVER (PARTITION BY . . . )

Helps us to get the same aggregate or result instead of using a new subquery

In [63]:
%%sql
-- # compare this one to below:
SELECT s1.department, 
       s1.last_name, 
       s1.salary,
       (SELECT ROUND(AVG(salary),2) 
            FROM staff s2 
            WHERE s1.department = s2.department)
         FROM staff s1
         ORDER BY department
         LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Automotive', 'Ortiz', 113231, Decimal('99658.00')),
 ('Automotive', 'Reed', 126001, Decimal('99658.00')),
 ('Automotive', 'Boyd', 69936, Decimal('99658.00')),
 ('Automotive', 'Jordan', 86939, Decimal('99658.00')),
 ('Automotive', 'Carr', 101768, Decimal('99658.00')),
 ('Automotive', 'Armstrong', 89969, Decimal('99658.00')),
 ('Automotive', 'Nguyen', 108378, Decimal('99658.00')),
 ('Automotive', 'Ross', 71363, Decimal('99658.00')),
 ('Automotive', 'Alexander', 144724, Decimal('99658.00')),
 ('Automotive', 'Fox', 87134, Decimal('99658.00'))]

In [64]:
%%sql
EXPLAIN ANALYZE 
    SELECT s1.department,
           s1.last_name, 
           s1.salary,
           (SELECT ROUND(AVG(salary),2) 
                FROM staff s2 
                WHERE s1.department = s2.department)
        FROM staff s1
        ORDER BY department
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
13 rows affected.

[('Limit  (cost=45.61..312.01 rows=10 width=50) (actual time=2.139..4.848 rows=10 loops=1)',),
 ('  ->  Result  (cost=45.61..26685.61 rows=1000 width=50) (actual time=2.134..4.839 rows=10 loops=1)',),
 ('        ->  Sort  (cost=45.61..48.11 rows=1000 width=18) (actual time=1.631..1.638 rows=10 loops=1)',),
 ('              Sort Key: s1.department',),
 ('              Sort Method: top-N heapsort  Memory: 26kB',),
 ('              ->  Seq Scan on staff s1  (cost=0.00..24.00 rows=1000 width=18) (actual time=0.043..0.596 rows=1000 loops=1)',),
 ('        SubPlan 1',),
 ('          ->  Aggregate  (cost=26.62..26.63 rows=1 width=32) (actual time=0.314..0.315 rows=1 loops=10)',),
 ('                ->  Seq Scan on staff s2  (cost=0.00..26.50 rows=45 width=4) (actual time=0.010..0.283 rows=46 loops=10)',),
 ('                      Filter: ((s1.department)::text = (department)::text)',),
 ('                      Rows Removed by Filter: 954',),
 ('Planning Time: 0.340 ms',),
 ('Execution Time: 4.953 ms',)]

In [65]:
%%sql
-- # much shorter, life saver
SELECT department, 
       last_name, 
       salary, 
       ROUND(AVG(salary) OVER(PARTITION BY department),2) average_department_salary
    FROM staff
    LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Automotive', 'Reed', 126001, Decimal('99658.00')),
 ('Automotive', 'Ortiz', 91296, Decimal('99658.00')),
 ('Automotive', 'Mcdonald', 111041, Decimal('99658.00')),
 ('Automotive', 'Torres', 120875, Decimal('99658.00')),
 ('Automotive', 'Peterson', 53964, Decimal('99658.00')),
 ('Automotive', 'Burns', 44377, Decimal('99658.00')),
 ('Automotive', 'Edwards', 140194, Decimal('99658.00')),
 ('Automotive', 'Nichols', 110589, Decimal('99658.00')),
 ('Automotive', 'Ross', 71363, Decimal('99658.00')),
 ('Automotive', 'Gordon', 136448, Decimal('99658.00'))]

In [66]:
%%sql
-- # less computational cost and shorter execution time
EXPLAIN ANALYZE
    SELECT department, 
           last_name, 
           salary, 
           ROUND(AVG(salary) OVER(PARTITION BY department),2) average_department_salary
        FROM staff
        LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
8 rows affected.

[('Limit  (cost=73.83..74.03 rows=10 width=50) (actual time=2.629..2.634 rows=10 loops=1)',),
 ('  ->  WindowAgg  (cost=73.83..93.83 rows=1000 width=50) (actual time=2.627..2.631 rows=10 loops=1)',),
 ('        ->  Sort  (cost=73.83..76.33 rows=1000 width=18) (actual time=2.581..2.583 rows=47 loops=1)',),
 ('              Sort Key: department',),
 ('              Sort Method: quicksort  Memory: 96kB',),
 ('              ->  Seq Scan on staff  (cost=0.00..24.00 rows=1000 width=18) (actual time=0.035..0.460 rows=1000 loops=1)',),
 ('Planning Time: 0.147 ms',),
 ('Execution Time: 2.705 ms',)]

### FIRST_VALUE()

In [69]:
%%sql
/*
# the following table will give us the comparison of each employee's salary vs the max salary of that department
# this is again both computaionally and time wise more efficient
*/
SELECT department, last_name, salary, 
         FIRST_VALUE(salary) OVER (PARTITION BY department ORDER BY salary DESC)
         FROM staff
         LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Automotive', 'Sanchez', 146167, 146167),
 ('Automotive', 'Alexander', 144724, 146167),
 ('Automotive', 'George', 141505, 146167),
 ('Automotive', 'Edwards', 140194, 146167),
 ('Automotive', 'Gordon', 136448, 146167),
 ('Automotive', 'Owens', 135326, 146167),
 ('Automotive', 'Schmidt', 133612, 146167),
 ('Automotive', 'Lawson', 130993, 146167),
 ('Automotive', 'Gordon', 129324, 146167),
 ('Automotive', 'Carroll', 128885, 146167)]

In [70]:
%%sql
/*
# what's different than choosing the max value per each department is that we can specify other order bys such as last name
# in this case the first value is the salary of the person with the first last_name in their department : Mr. Adams in Automotive, etc.
*/
SELECT department, last_name, salary, 
         FIRST_VALUE(salary) OVER (PARTITION BY department ORDER BY last_name)
         FROM staff
         LIMIT 10;

 * postgresql://postgres:***@localhost:5432/data_sci
10 rows affected.

[('Automotive', 'Adams', 79045, 79045),
 ('Automotive', 'Alexander', 144724, 79045),
 ('Automotive', 'Anderson', 126485, 79045),
 ('Automotive', 'Armstrong', 89969, 79045),
 ('Automotive', 'Boyd', 69936, 79045),
 ('Automotive', 'Burns', 44377, 79045),
 ('Automotive', 'Butler', 128448, 79045),
 ('Automotive', 'Carr', 101768, 79045),
 ('Automotive', 'Carroll', 128885, 79045),
 ('Automotive', 'Duncan', 45774, 79045)]

### RANK  
It helps to get the ranking for the order by value in each partition.  
Results are ordered both by the PARTITION BY AND ORDER BY values.

In [103]:
%%sql
SELECT department, 
       last_name, 
       salary, 
       RANK() OVER (PARTITION BY department ORDER BY salary DESC)
    FROM staff
    LIMIT 30;

 * postgresql://postgres:***@localhost:5432/data_sci
30 rows affected.

[('Automotive', 'Sanchez', 146167, 1),
 ('Automotive', 'Alexander', 144724, 2),
 ('Automotive', 'George', 141505, 3),
 ('Automotive', 'Edwards', 140194, 4),
 ('Automotive', 'Gordon', 136448, 5),
 ('Automotive', 'Owens', 135326, 6),
 ('Automotive', 'Schmidt', 133612, 7),
 ('Automotive', 'Lawson', 130993, 8),
 ('Automotive', 'Gordon', 129324, 9),
 ('Automotive', 'Carroll', 128885, 10),
 ('Automotive', 'Butler', 128448, 11),
 ('Automotive', 'Wright', 127521, 12),
 ('Automotive', 'Anderson', 126485, 13),
 ('Automotive', 'Reed', 126001, 14),
 ('Automotive', 'Schmidt', 121300, 15),
 ('Automotive', 'Torres', 120875, 16),
 ('Automotive', 'Thomas', 116487, 17),
 ('Automotive', 'Hawkins', 115506, 18),
 ('Automotive', 'Ortiz', 113231, 19),
 ('Automotive', 'Webb', 111689, 20),
 ('Automotive', 'Mcdonald', 111041, 21),
 ('Automotive', 'Nichols', 110589, 22),
 ('Automotive', 'Nguyen', 108378, 23),
 ('Automotive', 'Carr', 101768, 24),
 ('Automotive', 'Gonzales', 101006, 25),
 ('Automotive', 'Morris', 91932, 26),
 ('Automotive', 'Ortiz', 91296, 27),
 ('Automotive', 'Armstrong', 89969, 28),
 ('Automotive', 'Fox', 87134, 29),
 ('Automotive', 'Jordan', 86939, 30)]

`RANK()` can also be used without partitioning to get the rank in the entire table

In [102]:
%%sql
SELECT department, 
       last_name, 
       salary, 
       RANK() OVER (ORDER BY salary DESC)
    FROM staff
    LIMIT 30;

 * postgresql://postgres:***@localhost:5432/data_sci
30 rows affected.

[('Grocery', 'Stanley', 149929, 1),
 ('Toys', 'Greene', 149835, 2),
 ('Home', 'Morales', 149598, 3),
 ('Electronics', 'King', 149597, 4),
 ('Tools', 'Allen', 149586, 5),
 ('Kids', 'Freeman', 149351, 6),
 ('Computers', 'Stewart', 149336, 7),
 ('Games', 'Cox', 149221, 8),
 ('Jewelery', 'Riley', 149114, 9),
 ('Beauty', 'Long', 149099, 10),
 ('Computers', 'Williamson', 149085, 11),
 ('Grocery', 'Myers', 148993, 12),
 ('Electronics', 'Woods', 148986, 13),
 ('Kids', 'Morgan', 148952, 14),
 ('Tools', 'Harris', 148940, 15),
 ('Outdoors', 'Parker', 148906, 16),
 ('Outdoors', 'Dunn', 148889, 17),
 ('Garden', 'Reyes', 148860, 18),
 ('Industrial', 'Gibson', 148816, 19),
 ('Baby', 'Howard', 148687, 20),
 ('Home', 'Berry', 148640, 21),
 ('Baby', 'Tucker', 148573, 22),
 ('Clothing', 'Washington', 148408, 23),
 ('Outdoors', 'Bryant', 148260, 24),
 ('Toys', 'Stewart', 148144, 25),
 ('Grocery', 'Gonzalez', 148106, 26),
 ('Clothing', 'Freeman', 147868, 27),
 ('Toys', 'Ramirez', 147862, 28),
 ('Shoes', 'Ford', 147739, 29),
 ('Clothing', 'White', 147702, 30)]

### LAG

Gives you the row before the processed row

In [104]:
%%sql
SELECT department, last_name, salary, 
         LAG(salary) OVER (PARTITION BY department ORDER BY salary DESC)
         FROM staff
         LIMIT 20;

 * postgresql://postgres:***@localhost:5432/data_sci
20 rows affected.

[('Automotive', 'Sanchez', 146167, None),
 ('Automotive', 'Alexander', 144724, 146167),
 ('Automotive', 'George', 141505, 144724),
 ('Automotive', 'Edwards', 140194, 141505),
 ('Automotive', 'Gordon', 136448, 140194),
 ('Automotive', 'Owens', 135326, 136448),
 ('Automotive', 'Schmidt', 133612, 135326),
 ('Automotive', 'Lawson', 130993, 133612),
 ('Automotive', 'Gordon', 129324, 130993),
 ('Automotive', 'Carroll', 128885, 129324),
 ('Automotive', 'Butler', 128448, 128885),
 ('Automotive', 'Wright', 127521, 128448),
 ('Automotive', 'Anderson', 126485, 127521),
 ('Automotive', 'Reed', 126001, 126485),
 ('Automotive', 'Schmidt', 121300, 126001),
 ('Automotive', 'Torres', 120875, 121300),
 ('Automotive', 'Thomas', 116487, 120875),
 ('Automotive', 'Hawkins', 115506, 116487),
 ('Automotive', 'Ortiz', 113231, 115506),
 ('Automotive', 'Webb', 111689, 113231)]

### LEAD

Opposite of LAG. Second row to the first, third to the second, ... .

In [106]:
%%sql
SELECT department, last_name, salary, 
         LEAD(salary) OVER (PARTITION BY department ORDER BY salary DESC)
         FROM staff
         LIMIT 20;

 * postgresql://postgres:***@localhost:5432/data_sci
20 rows affected.

[('Automotive', 'Sanchez', 146167, 144724),
 ('Automotive', 'Alexander', 144724, 141505),
 ('Automotive', 'George', 141505, 140194),
 ('Automotive', 'Edwards', 140194, 136448),
 ('Automotive', 'Gordon', 136448, 135326),
 ('Automotive', 'Owens', 135326, 133612),
 ('Automotive', 'Schmidt', 133612, 130993),
 ('Automotive', 'Lawson', 130993, 129324),
 ('Automotive', 'Gordon', 129324, 128885),
 ('Automotive', 'Carroll', 128885, 128448),
 ('Automotive', 'Butler', 128448, 127521),
 ('Automotive', 'Wright', 127521, 126485),
 ('Automotive', 'Anderson', 126485, 126001),
 ('Automotive', 'Reed', 126001, 121300),
 ('Automotive', 'Schmidt', 121300, 120875),
 ('Automotive', 'Torres', 120875, 116487),
 ('Automotive', 'Thomas', 116487, 115506),
 ('Automotive', 'Hawkins', 115506, 113231),
 ('Automotive', 'Ortiz', 113231, 111689),
 ('Automotive', 'Webb', 111689, 111041)]

### NTH_VALUE()

In [99]:

%%sql
-- # finding 2nd highest value in every group
SELECT department,
       salary,
       NTH_VALUE(salary, 2) OVER (PARTITION BY department ORDER BY salary DESC)
    FROM staff
    LIMIT 50;

 * postgresql://postgres:***@localhost:5432/data_sci
50 rows affected.

[('Automotive', 146167, None),
 ('Automotive', 144724, 144724),
 ('Automotive', 141505, 144724),
 ('Automotive', 140194, 144724),
 ('Automotive', 136448, 144724),
 ('Automotive', 135326, 144724),
 ('Automotive', 133612, 144724),
 ('Automotive', 130993, 144724),
 ('Automotive', 129324, 144724),
 ('Automotive', 128885, 144724),
 ('Automotive', 128448, 144724),
 ('Automotive', 127521, 144724),
 ('Automotive', 126485, 144724),
 ('Automotive', 126001, 144724),
 ('Automotive', 121300, 144724),
 ('Automotive', 120875, 144724),
 ('Automotive', 116487, 144724),
 ('Automotive', 115506, 144724),
 ('Automotive', 113231, 144724),
 ('Automotive', 111689, 144724),
 ('Automotive', 111041, 144724),
 ('Automotive', 110589, 144724),
 ('Automotive', 108378, 144724),
 ('Automotive', 101768, 144724),
 ('Automotive', 101006, 144724),
 ('Automotive', 91932, 144724),
 ('Automotive', 91296, 144724),
 ('Automotive', 89969, 144724),
 ('Automotive', 87134, 144724),
 ('Automotive', 86939, 144724),
 ('Automotive', 84356, 144724),
 ('Automotive', 83177, 144724),
 ('Automotive', 82244, 144724),
 ('Automotive', 79045, 144724),
 ('Automotive', 71363, 144724),
 ('Automotive', 69936, 144724),
 ('Automotive', 69594, 144724),
 ('Automotive', 67800, 144724),
 ('Automotive', 66063, 144724),
 ('Automotive', 63364, 144724),
 ('Automotive', 58555, 144724),
 ('Automotive', 53964, 144724),
 ('Automotive', 47281, 144724),
 ('Automotive', 45774, 144724),
 ('Automotive', 44377, 144724),
 ('Automotive', 42602, 144724),
 ('Baby', 148687, None),
 ('Baby', 148573, 148573),
 ('Baby', 141464, 148573),
 ('Baby', 140004, 148573)]

### NTILE()
Assigns buckets/bins to the values

In [92]:
%%sql
SELECT department, 
       last_name, 
       salary, 
       NTILE(4) OVER (PARTITION BY department ORDER BY salary DESC)
    FROM staff
    LIMIT 20;

 * postgresql://postgres:***@localhost:5432/data_sci
20 rows affected.

[('Automotive', 'Sanchez', 146167, 1),
 ('Automotive', 'Alexander', 144724, 1),
 ('Automotive', 'George', 141505, 1),
 ('Automotive', 'Edwards', 140194, 1),
 ('Automotive', 'Gordon', 136448, 1),
 ('Automotive', 'Owens', 135326, 1),
 ('Automotive', 'Schmidt', 133612, 1),
 ('Automotive', 'Lawson', 130993, 1),
 ('Automotive', 'Gordon', 129324, 1),
 ('Automotive', 'Carroll', 128885, 1),
 ('Automotive', 'Butler', 128448, 1),
 ('Automotive', 'Wright', 127521, 1),
 ('Automotive', 'Anderson', 126485, 2),
 ('Automotive', 'Reed', 126001, 2),
 ('Automotive', 'Schmidt', 121300, 2),
 ('Automotive', 'Torres', 120875, 2),
 ('Automotive', 'Thomas', 116487, 2),
 ('Automotive', 'Hawkins', 115506, 2),
 ('Automotive', 'Ortiz', 113231, 2),
 ('Automotive', 'Webb', 111689, 2)]

### WIDTH_BUCKET()

Helps with finding which the bucket the current row will fall into

In [108]:
%%sql
SELECT department,
       last_name,
       salary,
       WIDTH_BUCKET(salary, 0, 150000, 10) -- range between $0 and $150000 in 10 buckets
    FROM staff
    LIMIT 30;

 * postgresql://postgres:***@localhost:5432/data_sci
30 rows affected.

[('Computers', 'Kelley', 67470, 5),
 ('Sports', 'Armstrong', 71869, 5),
 ('Automotive', 'Carr', 101768, 7),
 ('Jewelery', 'Murray', 96897, 7),
 ('Grocery', 'Ellis', 63702, 5),
 ('Tools', 'Phillips', 118497, 8),
 ('Computers', 'Williamson', 65889, 5),
 ('Toys', 'Harris', 84427, 6),
 ('Jewelery', 'James', 108657, 8),
 ('Movies', 'Sanchez', 108093, 8),
 ('Jewelery', 'Jacobs', 121966, 9),
 ('Clothing', 'Black', 44179, 3),
 ('Baby', 'Schmidt', 85227, 6),
 ('Computers', 'Webb', 59763, 4),
 ('Games', 'Jacobs', 141139, 10),
 ('Baby', 'Medina', 106659, 8),
 ('Kids', 'Morgan', 148952, 10),
 ('Home', 'Nguyen', 93804, 7),
 ('Electronics', 'Day', 109890, 8),
 ('Movies', 'Carr', 115274, 8),
 ('Industrial', 'Bryant', 78052, 6),
 ('Automotive', 'Alexander', 144724, 10),
 ('Jewelery', 'Chapman', 126103, 9),
 ('Garden', 'Kelly', 144965, 10),
 ('Toys', 'Stephens', 70613, 5),
 ('Home', 'Porter', 90746, 7),
 ('Home', 'Owens', 78698, 6),
 ('Books', 'Scott', 63336, 5),
 ('Clothing', 'Price', 95436, 7),
 ('Beauty', 'Weaver', 83144, 6)]

### CUME_DIST()

Takes a specification o what we're accumulating over, so needs a order by statement.

In [111]:
%%sql
SELECT department,
       last_name,
       salary,
       CUME_DIST() OVER (ORDER BY salary DESC) cume,
       ROUND((CUME_DIST() OVER (ORDER BY salary DESC)*100)::numeric, 2) cume_perc
    FROM staff
    LIMIT 30;

 * postgresql://postgres:***@localhost:5432/data_sci
30 rows affected.

[('Grocery', 'Stanley', 149929, 0.001, Decimal('0.10')),
 ('Toys', 'Greene', 149835, 0.002, Decimal('0.20')),
 ('Home', 'Morales', 149598, 0.003, Decimal('0.30')),
 ('Electronics', 'King', 149597, 0.004, Decimal('0.40')),
 ('Tools', 'Allen', 149586, 0.005, Decimal('0.50')),
 ('Kids', 'Freeman', 149351, 0.006, Decimal('0.60')),
 ('Computers', 'Stewart', 149336, 0.007, Decimal('0.70')),
 ('Games', 'Cox', 149221, 0.008, Decimal('0.80')),
 ('Jewelery', 'Riley', 149114, 0.009, Decimal('0.90')),
 ('Beauty', 'Long', 149099, 0.01, Decimal('1.00')),
 ('Computers', 'Williamson', 149085, 0.011, Decimal('1.10')),
 ('Grocery', 'Myers', 148993, 0.012, Decimal('1.20')),
 ('Electronics', 'Woods', 148986, 0.013, Decimal('1.30')),
 ('Kids', 'Morgan', 148952, 0.014, Decimal('1.40')),
 ('Tools', 'Harris', 148940, 0.015, Decimal('1.50')),
 ('Outdoors', 'Parker', 148906, 0.016, Decimal('1.60')),
 ('Outdoors', 'Dunn', 148889, 0.017, Decimal('1.70')),
 ('Garden', 'Reyes', 148860, 0.018, Decimal('1.80')),
 ('Industrial', 'Gibson', 148816, 0.019, Decimal('1.90')),
 ('Baby', 'Howard', 148687, 0.02, Decimal('2.00')),
 ('Home', 'Berry', 148640, 0.021, Decimal('2.10')),
 ('Baby', 'Tucker', 148573, 0.022, Decimal('2.20')),
 ('Clothing', 'Washington', 148408, 0.023, Decimal('2.30')),
 ('Outdoors', 'Bryant', 148260, 0.024, Decimal('2.40')),
 ('Toys', 'Stewart', 148144, 0.025, Decimal('2.50')),
 ('Grocery', 'Gonzalez', 148106, 0.026, Decimal('2.60')),
 ('Clothing', 'Freeman', 147868, 0.027, Decimal('2.70')),
 ('Toys', 'Ramirez', 147862, 0.028, Decimal('2.80')),
 ('Shoes', 'Ford', 147739, 0.029, Decimal('2.90')),
 ('Clothing', 'White', 147702, 0.03, Decimal('3.00'))]

## Common Table Expressions (CTE)

Auxilliary statements that we create to use in larger queries. Usually we create temporary tables to simplify the query that would other wise require subqueries. They also help to work with hierarchical data structures.

```sql
WITH <table_name> AS <select_statement>,
     <table_name> AS <select_statement>,
     <table_name> AS <select_statement>
SELECT
...
```

In [117]:
%%sql
-- # getting information from regions with above average salaries
WITH region_salaries AS -- # first cte
                        (SELECT region_id, 
                                SUM(salary) region_salary
                            FROM employees
                            GROUP BY region_id),
     top_region_salaries AS -- # second cte based on first cte
                            (SELECT region_id
                                FROM region_salaries
                                WHERE region_salary > (SELECT SUM(region_salary)/7 FROM region_salaries)) -- # subquery, 7 is the number of regions
SELECT *
    FROM region_salaries
    WHERE region_id IN (SELECT region_id FROM top_region_salaries); -- # using 2nd cte

 * postgresql://postgres:***@localhost:5432/data_sci
3 rows affected.

[(7, 16258438), (4, 17596378), (2, 15317554)]

In [123]:
%%sql
-- # show total and avg salary from east regions
WITH east_regions AS 
                    (SELECT region_id
                        FROM company_regions
                        WHERE region_name ILIKE '%east%')
SELECT SUM(salary) tot_sal,
       ROUND(AVG(salary), 2) avg_sal
       FROM employees
       WHERE region_id IN (SELECT region_id FROM east_regions)

 * postgresql://postgres:***@localhost:5432/data_sci
1 rows affected.

[(29855653, Decimal('95385.47'))]

### Recursive Tables

We can think of recursive CTEs as paths going from leaf node to the root.

In [118]:
%%sql
-- # Hierarchical example: notice the structure with CEO Office having null for parent_department_id
SELECT *
    FROM org_structure;

 * postgresql://postgres:***@localhost:5432/data_sci
7 rows affected.

[(1, 'CEO Office', None),
 (2, 'VP Sales', 1),
 (3, 'VP Operations', 1),
 (4, 'Northeast Sales', 2),
 (5, 'Northwest Sales', 2),
 (6, 'Infrastructure Operations', 3),
 (7, 'Management Operations', 3)]

In [ ]:
%%sql
-- # find the path from a department to the CEO Office
WITH recursive report_structure(id, department_name, parent_department_id) AS
(
  SELECT id,
         department_name,
         parent_department_id
       FROM org_structure
       WHERE  id = 7         -- # the department we're working with
  UNION
  SELECT os.id,
         os.department_name,
         os.parent_department_id
       FROM org_structure os
           JOIN report_structure rs -- # to implement the rtecursion we need to join with our report
               ON rs.parent_department_id = os.id)
SELECT * -- # this is the primary select statement after we have created the recursion
      FROM report_structure;